tutorials/incompressibleVoF/wave3D/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

xyBox
{
    type    box;

    coordinates
    {
        type        global;

        e1          (1 0 0);
        e2          (0 1 0);

        directions  (e1 e2);
    }
}

zBox
{
    $xyBox;

    coordinates
    {
        directions      (e3);
    }
}

zones
{
    xy1
    {
        $xyBox;
        box     (-1e6 -1e6 -40) (1300 1300 40);
    }

    xy2
    {
        $xyBox;
        box     (-1e6 -1e6 -30) (1200 1200 30);
    }

    z1
    {
        $zBox;
        box     (-1e6 -1e6 -40) (1e6 1e6 40);
    }

    z2
    {
        $zBox;
        box     (-1e6 -1e6 -30) (1e6 1e6 30);
    }

    z3
    {
        $zBox;
        box     (-1e6 -1e6 -20) (1e6 1e6 20);
    }

    z4
    {
        $zBox;
        box     (-1e6 -1e6 -10) (1e6 1e6 10);
    }
}

// ************************************************************************* //
